{
  "overview": "This file controls what item affixes (groups of item modifiers) are applied as the prefix for an item These item affixes will appear at the start of an item’s name  This file is loaded together with other similar files in the following order: magicsuffix.txt, magicprefix.txt, automagic.txt These combined files form the Item Mods structure.  Any column field name starting with “*” is considered a comment field and is not used by the game",
  "data_fields": [
    {
      "name": "Name",
      "description": "Defines the item affix name"
    },
    {
      "name": "version",
      "description": "Defines which game version to use this item affix (<100 = Classic mode | 100 = Expansion mode)"
    },
    {
      "name": "spawnable",
      "description": "Boolean Field. If equals 1, then this item affix is used as part of the game’s randomizer for assigning item modifiers when an item spawns. If equals 0, then this item affix is never used."
    },
    {
      "name": "rare",
      "description": "Boolean Field. If equals 1, then this item affix can be used when randomly assigning item modifiers when a rare item spawns. If equals 0, then this item affix is not used for rare items."
    },
    {
      "name": "level",
      "description": "The minimum item level required for this item affix to spawn on the item. If the item level is below this value, then the item affix will not spawn on the item."
    },
    {
      "name": "maxlevel",
      "description": "The maximum item level required for this item affix to spawn on the item. If the item level is above this value, then the item affix will not spawn on the item."
    },
    {
      "name": "levelreq",
      "description": "The minimum character level required to equip an item that has this item affix"
    },
    {
      "name": "classspecific",
      "description": "Controls if this item affix should only be used for class specific items. This relies on the class specified in the “Class” field from ItemTypes.txt, for the specific item. Code (empty) ama bar pal nec sor dru ass Description Any Class Amazon only Barbarian only Paladin only Necromancer only Sorceress only Druid only Assassin only"
    },
    {
      "name": "class",
      "description": "Controls which character class is required for the class specific level requirement “classlevelreq” field Description Code (empty) None ama bar pal nec sor dru ass Amazon Barbarian Paladin Necromancer Sorceress Druid Assassin"
    },
    {
      "name": "classlevelreq",
      "description": "The minimum character level required for a specific class in order to equip an item that has this item affix. This relies on the class specified in the “class” field. If equals null, then the class will default to using the “levelreq” field."
    },
    {
      "name": "frequency",
      "description": "Controls the probability that the affix appears on the item (a higher value means that the item affix will appear on the item more often). This value gets summed together with other “frequency” values from all possible item affixes that can spawn on the item, and then is used as a denominator value for the randomizer. Whichever item affix is randomly selected will be the one to appear on the item. The formula is calculated as the following: [Item Affix Selected] = [“frequency”] / [Total Frequency]. If the item has a magic level (from the “magic lvl” field in weapons.txt/armor.txt/misc.txt) then the magic level value is multiplied with this value. If equals 0, then this item affix will never appear on an item."
    },
    {
      "name": "group",
      "description": "Assigns an item affix to a specific group number. Items cannot spawn with more than 1 item affix with the same group number. This is used to guarantee that certain item affixes do not overlap on the same item. If this field is null, then the group number will default to group 0."
    },
    {
      "name": "mod1code (to mod3code)",
      "description": "Controls the item properties for the item affix (Uses the “code” field from Properties.txt)"
    },
    {
      "name": "mod1param (to mod3param)",
      "description": "The “parameter” value associated with the listed property (mod). Usage depends on the property function (See the “func” field on Properties.txt)"
    },
    {
      "name": "mod1min (to mod3min)",
      "description": "The “min” value to assign to the listed property (mod). Usage depends on the property function (See the “func” field on Properties.txt)"
    },
    {
      "name": "mod1max (to mod3 max)",
      "description": "The “max” value to assign to the listed property (mod). Usage depends on the property function (See the “func” field on Properties.txt)"
    },
    {
      "name": "transformcolor",
      "description": "Controls the color change of the item after spawning with this item affix. If empty, then the item affix will not change the item’s color. (Uses Color Codes from the reference file colors.txt) Code Color No color change White Light Grey Dark Grey Black Light Blue Dark Blue Crystal Blue Light Red Dark Red Crystal Red Light Green Dark Green Crystal Green Light Yellow Dark Yellow Light Gold Dark Gold Light Purple Dark Purple Orange Bright White whit lgry dgry blac lblu dblu cblu lred dred cred lgrn dgrn cgrn lyel dyel lgld dgld lpur dpur oran bwht"
    },
    {
      "name": "itype1 (to itype7)",
      "description": "Controls what Item Types are allowed to spawn with this item affix. Uses the “code” field from ItemTypes.txt"
    },
    {
      "name": "etype1 (to etype5)",
      "description": "Controls what Item Types are excluded to spawn with this item affix. Uses the “code” field from ItemTypes.txt"
    },
    {
      "name": "multiply",
      "description": "Multiplicative modifier for the item’s buy and sell costs, based on the item affix (Calculated in 1024ths for buy cost and 4096ths for sell cost)"
    },
    {
      "name": "add",
      "description": "Flat integer modification to the item’s buy and sell costs, based on the item affix"
    }
  ],
  "filename": "MagicPrefix.txt"
}